career-change-progress-track.org
#+title: Career Change - Progress Track
#+date: [2025-12-28 Sun 13:14]
#+HUGO_BASE_DIR: /home/james/wiki/.site
#+HUGO_SECTION: 
#+HUGO_DRAFT: false
#+HUGO_DATE: 2025-12-28
#+EXPORT_FILE_NAME: career-change-progress-track

* Overview
:PROPERTIES:
:ID:       20251228T131451.300099
:END:

On this page, I will link all the weeks and maybe a brief description/evaluation of each week.

** [[id:20251228T131932.226837][Week 0]]

I gave myself a head start here, an initial "nitro boost" if you will.
So instead of starting on the 1st of January 2026 like any other "New Year's Resolution" project.
I dived right in, the very next day after making my [[id:20251227T183632.488529][12 weeks plan]] ( 2025-12-28 ).
