.site/content/career-change-progress-track.md
+++
title = "Career Change - Progress Track"
author = ["James"]
date = 2025-12-28T13:14:00+00:00
draft = false
+++

## Overview {#overview}

On this page, I will link all the weeks and maybe a brief description/evaluation of each week.


### [Week 0](/career-change-week-0/#content) {#week-0--career-change-week-0-dot-md}

I gave myself a head start here, an initial "nitro boost" if you will.
So instead of starting on the 1st of January 2026 like any other "New Year's Resolution" project.
I dived right in, the very next day after making my [12 weeks plan](/12-weeks-action-plan-for-my-career-change/#week-11-12-interview-drill) ( 2025-12-28 ).
